# -*- coding: utf-8 -*-
from generate_frequency_dict import frequency_analyse, frequency
from main import encrypt


def break_notepad(text: str, d: dict = {}) -> str:
    lst = frequency_analyse()
    lst_from_txt = frequency_analyse(frequency(text))

    notepad = generate_notepad_from_two_lists(lst, lst_from_txt)
    notepad = modificate_dict(notepad, d)

    return encrypt(text, notepad)


def generate_notepad_from_two_lists(lst1: list, lst2: list) -> dict:
    return {k: v for v, k in zip(lst1, lst2)}


def modificate_dict(notepad: dict, d: dict):
    for key, value in d.items():
        notepad_reversed = {v: k for k, v in notepad.items()}
        orignal_letter = notepad_reversed[value]
        notepad[orignal_letter] = notepad[key]
        notepad[key] = value

    print(notepad)

    return notepad


print(break_notepad('''зг тмеяе ы йезыс, еамуьр ез ыъцсты. брсгзпмцф йяцзщ вртчйрс бгзы ъейяетрбц, зе мельр ы
тйярнцърс е эгб-зциуьп, ез тсеъзе ц зг тсчнрс. сцнп йезгбзелу, цв тсуэрфзчо, бцбеоеьеб
еияезгззчо тсеъ бзг ътг еамячсетп. арм, мельр ез ъйгяъчг уъцьгс беф трбесга (трбесга ы яцтеърап зг тарзу, бзг ътг яръзе зг тйяръцапты), ез тйяетцс:
– эае хае вр наумр?
– хае зг наумр. хае трбесга. беф трбесга. ез сгарга.
ц ы т леяьетапш еижытзцс гбу, эае убгш сгарап. аельр ез ъетмсцмзус:
– мрм! ач уйрс т згир?
– ьр, – тмяебзе еаъгацс ы.
– ъеа вриръзе!..
ц брсгзпмцф йяцзщ въезме вртбгысты, арм эае бгзы ъвыср ьетрьр: ы сшисш, эаеич м бецб
всемсшэгзцыб еазетцсцтп тгяпгвзе. йеаеб ез йяциръцс:
– взрэца, ач аеюг ыъцсты т згир. р т мрмеф йсрзгач?
«арм ъеа ярвлрьмр гле арцзтаъгззеле йеыъсгзцы вьгтп, ъ йутачзг!» – йеьубрс ы ц тйяетцс
зрйяыбцм:
– тарсе ичап, ач йейрс тшьр т ьяулеф йсрзгач?
зе ез зг еаъгацс. ез ацое йемрэрс лесеъеф, ярвлсыьчъры беф трбесга:
– зу, зр хаеб ач зг бел йяцсгагап цвьрсгмр…
ц зрьесле врьубрсты е эгб-ае. йеаеб ъчзус цв мрябрзр бегле ирярнмр ц йеляувцсты ъ тевгящрзцг хаеле темяеъцдр.
беюгаг тгиг йягьтаръцап, мрм ярвлеягсетп бег сшиейчатаъе еа хаеле йесуйяцвзрзцы е
«ьяулцо йсрзгаро». ц ы йейчарсты ярвувзрап йеиеспнг:
– еамуьр юг ач йяцсгагс, брсчн? льг аъеф ьеб? муьр ач оеэгнп узгтац бегле ирярнмр?
ез йебесэрс ъ ярвьубпг, йеаеб тмрврс:
– еэгзп оеяене, эае ач ьрс бзг ыдцм: ирярнгм иуьга арб тйрап йе зеэрб.
– зу мезгэзе. ц гтсц ач иуьгнп убзцщгф, ы ьрб агиг ъгягъму, эаеич ьзгб гле йяцъывчърап.
ц месчнгм.
брсгзпмцф йяцзщ зробуяцсты:
– йяцъывчърап? ьсы эгле хае?
– зе ъгьп гтсц ач гле зг йяцъыюгнп, ез вриягьга згъгьебе муьр ц йеагяыгаты.
ауа беф ьяул ейыап ъгтгсе ярттбгысты:
– ьр муьр юг ез йефьга?''', {'з': 'н', 'г': 'е', 'т': 'с', 'м': 'к', 'ы': 'я', 'й': 'п', 'е': 'о', 'с': 'л', 'б': 'м'}))
